[
 
  {
    "title": "The artist becomes the trader becomes the artist.",
    "author": "Trevor McFedries",
    "source": "X",
    "url": "https://x.com/whatdotcd/status/1998765086861930691",
    "badge": "★",
    "review": "The only essay I've ever read that accurately diagnoses what's broken: artists grinding themselves into dust playing algorithm games when their real skill is reading culture and taking positions. The hot take is that trading infrastructure is more aligned with how artists think than our current content-marketing hellscape. Artists have ALWAYS gotten paid when the market validates their thesis, the difference now is they can finally capture that value directly instead of feeding it to galleries, labels, or platforms. Art is a tradable asset. Always has been."
  },
  {
    "title": "1,000 True Fans",
    "author": "Kevin Kelly",
    "source": "The Technium",
    "url": "https://kk.org/thetechnium/1000-true-fans/",
    "badge": "★",
    "review": "The essay that launched a thousand creator economies. Still the clearest articulation of how the internet changes who can make a living from their work."
  },
  {
    "title": "A coat check ticket, a magic spell",
    "author": "Robin Sloan",
    "source": "Dragon Catcher",
    "url": "https://www.robinsloan.com/lab/art-objects/",
    "badge": "",
    "review": "Robin Sloan's Amulets project remains one of my favorite things ever created in crypto, which makes it genuinely sad that he's moved on from experimenting in the space. This essay captures what made it special. Someone who was both curious and skeptical, building something that felt like genuine magic."
  },
  {
    "title": "Startup Slop",
    "author": "Jihad Esmail",
    "source": "Jihad.house",
    "url": "https://jihad.house/notes/startup-slop/",
    "badge": "",
    "review": "OAbsolutely surgical takedown of performative entrepreneurship. The kind of essay that should make you immediately audit your own behavior upon reading."
  },
  {
    "title": "Running a Paid Membership Program",
    "author": "Craig Mod",
    "source": "Craigmod.com",
    "url": "https://craigmod.com/essays/membership_programs/",
    "badge": "",
    "review": "The most honest thing ever written about running paid subscriptions. Craig just tells you everything: The money, the feelings, the weird guilt, the whole deal. I send this to every creator I know who's thinking about paywalling their work."
  },
  {
    "title": "Who Stole Beauty from Men?",
    "author": "Julie Fredrickson",
    "source": "Nice Packaging",
    "url": "https://nicepackaging.substack.com/p/who-stole-beauty-from-men?r=2cdk&utm_medium=twitter&triedRedirect=true",
    "badge": "",
    "review": "Unexpectedly niche for this page but I don't care. I had dry, flaky skin for years and the recs here (The Ordinary) completely fixed it. Sometimes the most valuable essays are just someone telling you what actually works."
  },
  {
    "title": "An app can be a home-cooked meal",
    "author": "Robin Sloan",
    "source": "robinsloan.copm",
    "url": "https://www.robinsloan.com/notes/home-cooked-app/",
    "badge": "★",
    "review": "Everything is corporate now, everything scales, everything's optimized. Robin makes the case for digital things that feel like home. Small, personal, maybe a little janky, built for the people you actually know. We need more apps that feel cozy."
  }
]