{
  "2023": [
    {
      "title": "Tokyo Godfathers",
      "badge": "❤",
      "review": "A trio of homeless misfits find an abandoned baby on Christmas Eve. A poignant story of redemption told through crisp animation and effective symbolism."
    },
    {
      "title": "The Conversation",
      "badge": "❤",
      "review": "A paranoid thriller told through transfixing sound design and a sustained focus on Hackman's haunted, tightly coiled performance. A slow-burn narrative about someone fixated on surveilling others but unable to discern the world around them."
    },
    {
      "title": "The Mission",
      "badge": "❤",
      "review": "Grapples with Christian culture as colonialism, documenting the life of a young 'missionary' who was murdered when he tried to contact what is perhaps the last isolated tribe in existence. Showcases the problematic nature of the great commission as understood by evangelicals."
    },
    {
      "title": "In Bruges",
      "badge": "❤",
      "review": "A darkly comic, melancholic exploration of guilt, redemption, and the absurdity of life. A twisted tragicomedy, and also, kinda sorta, a Christmas movie."
    },
    {
      "title": "Total Recall",
      "badge": null,
      "review": "Not a particularly good movie in my opinion, but I love the world-building at play here. Mars and a rundown Earth, mutants in the resistance, Johnnycab robo-Taxis, and a government that sells people air at a premium. It's all served up with 80s-era cheese, but unlike so many modern blockbusters that are polished to an impersonal and sterile sheen, this film radiates raw authenticity."
    },
    {
      "title": "U.S. Marshals",
      "badge": null,
      "review": "Unjustly maligned, its cardinal sin seems to be that it just isn't as good as The Fugitive. Which…yes! It lacks the sleek urgency of its predecessor, but it offers compensation by shifting the focus to the excellent Tommy Lee Jones."
    },
    {
      "title": "The Fugitive",
      "badge": "❤",
      "review": "Classic cat-and-mouse drama — a wrongly convicted man against a tenacious U.S. Marshal. Ford brings a weary charisma, but Tommy Lee Jones snagged an Oscar for his scene-chewing performance and is simply incredible to watch."
    },
    {
      "title": "Breakdown",
      "badge": "❤",
      "review": "A quintessential 90s thriller starring Kurt Russell as an out-of-his-element suburbanite stuck in a desolate, forgotten corner of the country where the rules of civilization seem distorted, if not entirely absent."
    },
    {
      "title": "Killers of the Flower Moon",
      "badge": "❤",
      "review": "The harrowing true story of the systematic murder of Osage Indians in 1920s Oklahoma for their oil fortune. This may be Scorsese's bleakest yet, and that's saying something after having recently watched Silence."
    },
    {
      "title": "The Game",
      "badge": "❤",
      "review": "A twisty thriller centered around a wealthy investment banker who receives an unusual birthday gift from his wayward brother: an invitation to play a game run by a mysterious entertainment company."
    },
    {
      "title": "Kick-Ass",
      "badge": null,
      "review": "A playful, semi-satirical salute to caped crusaders and the fantasies they inspire. Not particularly good, but Cage is fun to watch as he channels his inner Adam West."
    },
    {
      "title": "Love Has Won: The Cult of Mother God",
      "badge": null,
      "review": "Terrifying portrait of how leaders can spiritually manipulate not only their followers, but themselves, made all the more chilling because so many of her followers still very much believe."
    },
    {
      "title": "Please Don't Destroy: The Treasure of Foggy Mountain",
      "badge": null,
      "review": "Too enamored of its own quirky in-jokes, this feature extension of the SNL sketch troupe's absurdism collapses under cartoonish chaos, mistaking manic energy as a substitute for wit or narrative purpose."
    },
    {
      "title": "Theater Camp",
      "badge": "❤",
      "review": "Every character shines in this satirical look behind the curtains of a summer camp dedicated to the dramatic arts. Likely my favorite comedy of the year."
    },
    {
      "title": "The Postman",
      "badge": "❤",
      "review": "A curious artifact of 90s idealism. There's an undeniable charm in this post-apocalyptic epic, but it gets choked up by an overwhelmingly long run time and mistaking scale for substance. Still, I enjoyed this sweeping and optimistic story of the enduring strength of humanity and its symbols."
    },
    {
      "title": "The Killer",
      "badge": "❤",
      "review": "The life of an assassin depicted not as a glamorized series of action-packed sequences but a careful, extremely tedious existence revolving around intricate planning and precise execution. A refreshing deviation from the genre's norms.",
      "year": 2023
    },
    {
      "title": "After Hours",
      "badge": "❤",
      "review": "Scorsese nails black comedy tension as a mundane word processor's night out spirals into a Kafkaesque ordeal, realized through paranoid camerawork and a descent into a dreamlike cityscape filled with oddball characters."
    },
    {
      "title": "Dallas Buyers Club",
      "badge": null,
      "review": "An underdog drama which brings empathy and advocacy to the AIDS crisis through one tenacious hustler's singular crusade. Unfortunately, not particularly memorable or nuanced."
    },
    {
      "title": "Haunted Mansion",
      "badge": null,
      "review": "Attempts to bring the beloved theme park attraction to life but ends up lost in its own corridors of lackluster gags and scares. A great cast is wasted in a plot that feels aimless, uninspiring, and sterile."
    },
    {
      "title": "The Nightmare Before Christmas",
      "badge": "❤",
      "review": "A timeless classic, a magical, musical haunt that I'll always want to watch in the transitory period between Halloween and Christmas."
    },
    {
      "title": "American Hustle",
      "badge": "❤",
      "review": "Snappy dialogue and an intricate plot weave a compelling narrative of ambition and illusion that captures 70s gaudy glamour. Fantastic cast, every character is a pleasure to watch."
    },
    {
      "title": "Hot Fuzz",
      "badge": "❤",
      "review": "In my opinion, the best of Edgar Wright's loose trilogy. The film's clever script and kinetic editing are a masterclass, all set in a rural village with a sinister secret and a high body count."
    },
    {
      "title": "Shaun of the Dead",
      "badge": null,
      "review": "A loving homage and sharp satire of zombie films. Simon Pegg's everyman character lets Edgar Wright's clever directorial skills shine."
    },
    {
      "title": "Hard Boiled",
      "badge": "❤",
      "review": "Incredible to watch simply because all problems are solved with guns. Trying to open a door? Shoot the knob. Need to stop someone from coming down an elevator? Shoot the controls. A nursery full of babies is taken hostage and the protagonist shoots his way into the room and then shoots his way out."
    },
    {
      "title": "Point Break",
      "badge": "❤",
      "review": "An earnest examination of masculinity told within a slick blockbuster shell. Bigelow brings propulsive style to Reeves and Swayze's chemistry.",
      "year": 1991
    },
    {
      "title": "Meet Joe Black",
      "badge": "❤",
      "review": "A perfect example of 'They don't make 'em like they used to.' I love that a movie with the personification of death as a main character still manages to be a quintessential 90s comfort movie."
    },
    {
      "title": "Silence",
      "badge": "★",
      "review": "A harrowing odyssey of faith and suffering. Scorsese brings deep empathy and visual poetry to Endo's spiritual saga, faithfully rendering intellectual complexity through a nuanced character study rather than providing easy answers."
    },
    {
      "title": "The Wonderful Story of Henry Sugar",
      "badge": "❤",
      "review": "The Roald Dahl story that left the deepest impression on me, faithfully reproduced in a way that made my inner child very happy. Visual storytelling that's as sweet and rich as its protagonist's journey."
    },
    {
      "title": "American Sniper",
      "badge": null,
      "review": "A compelling examination of military service and the scars it leaves behind. I appreciated it most when it left behind the sand-swept landscapes and stuck Bradley Cooper at a carwash in his hometown."
    },
    {
      "title": "Deep Cover",
      "badge": "❤",
      "review": "A sleek, sinister thriller. Laurence Fishburne is exceptional as a morally conflicted cop who gets in too deep with Jeff Goldblum's dangerously charismatic character."
    },
    {
      "title": "Bringing Out the Dead",
      "badge": "❤",
      "review": "A nightmarish day in the life of an EMT who believes his role is to witness the dead, not to save them. Dives headlong into existential exhaustion and guilt, realized through jittery camerawork and a manic, mesmerizing performance from Cage."
    },
    {
      "title": "Hollywood Shuffle",
      "badge": null,
      "review": "Townsend's bold satirical debut examines demeaning media stereotypes of black actors through sly sketches and an endearing comedic performance. A clever, crucial commentary."
    },
    {
      "title": "Before the Devil Knows You're Dead",
      "badge": null,
      "review": "Wallows in bleak hopelessness instead of exploring moral complexity. Strong performances feel wasted on intolerable characters ensnared in a nihilistic spiral of horrific violence."
    },
    {
      "title": "The Godfather",
      "badge": "❤",
      "review": "Coppola elevates pulp source material into epic tragedy through iconic imagery, simmering violence, and career-defining performances."
    },
    {
      "title": "Amsterdam",
      "badge": null,
      "review": "A curious and chaotic journey, a winding road of intention that doesn't always find its destination. Extremely fun performances, especially from Bale, within an overstuffed plot."
    },
    {
      "title": "The End of the Tour",
      "badge": "❤",
      "review": "A dialogue-driven dance between journalist and subject. A quiet contemplation of fame, creativity, and the human condition. Also, a road movie!"
    },
    {
      "title": "Late Night",
      "badge": null,
      "review": "Keen to laugh at its own industry, but a little too toothless to actually do so in a meaningful way."
    },
    {
      "title": "Edge of Tomorrow",
      "badge": "❤",
      "review": "High-concept sci-fi, a clever twist on both the alien invasion narrative and Groundhog Day style time loops. Each reset raises the stakes and deepens the characters in a way that's incredibly watchable."
    },
    {
      "title": "Blazing Saddles",
      "badge": null,
      "review": "A no-holds-barred spoof of western tropes that still packs subversive gut punches all these years later."
    },
    {
      "title": "In Time",
      "badge": null,
      "review": "Interesting critique of class disparity squandered by a generic Bonnie and Clyde plot. The execution sadly doesn't match the ambition."
    },
    {
      "title": "Escape at Dannemora",
      "badge": "❤",
      "review": "A truth-is-stranger-than-fiction prison break with incredible performances and a deep sense of the human stakes involved."
    },
    {
      "title": "The King of Comedy",
      "badge": null,
      "review": "A dark, disquieting satire on fame and delusion. The biting commentary on celebrity culture and the media is as relevant as ever."
    },
    {
      "title": "Noah",
      "badge": "★",
      "review": "One of my favorite movies, I try to watch it once a year. An audacious Old Testament epic that infuses the familiar tale with earthy naturalism and psychological depth. A polarizing, provocative watch, and I love every second."
    },
    {
      "title": "Bowfinger",
      "badge": null,
      "review": "A heartfelt homage to the dreamers and schemers of Hollywood. A satire that's both sharp and sweet, poking fun at the industry while celebrating the underdog spirit."
    },
    {
      "title": "Goldfinger",
      "badge": null,
      "review": "The quintessential Connery Bond film, ratcheting up the gadgets, stunts, one-liners and iconic set pieces that codified the superspy fantasy."
    },
    {
      "title": "Permanent Midnight",
      "badge": "❤",
      "review": "This unflinching adaptation of an addiction memoir provides space for Ben Stiller to shed his comic persona in service of an uncomfortably intimate descent into heroin-fueled self-destruction."
    },
    {
      "title": "The Player",
      "badge": null,
      "review": "Altman applies his kaleidoscopic cynicism to Hollywood satire, training his sights on studio executives while packing the frames with star cameos befitting the milieu's preoccupation with celebrity."
    },
    {
      "title": "Demolition Man",
      "badge": null,
      "review": "Stallone vehicles rarely achieve more than guilty pleasure status, but the campy world-building embraces the absurdity inherent to the cryogenically frozen cop premise."
    },
    {
      "title": "Barton Fink",
      "badge": null,
      "review": "A nightmarish descent into writer's block, surrealism, and Hollywood cynicism, blending mood and symbolism through sinister design, stifling cinematography, and an unhinged cast."
    },
    {
      "title": "Adaptation.",
      "badge": "★",
      "review": "One of my favorite films, in constant conversation with the viewer throughout. A metafictional masterpiece giving Nicolas Cage the dual performances of a lifetime, embodying the tortured artist and his twin with equal parts humor and pathos."
    },
    {
      "title": "Brigsby Bear",
      "badge": null,
      "review": "A unique premise executed with tender sincerity. A coming-of-age tale, grounded entirely in the off-kilter but touchingly earnest portrayal of Kyle Mooney's sheltered protagonist."
    },
    {
      "title": "Women Talking",
      "badge": null,
      "review": "Despite a powerful true story backdrop and strong performances from its ensemble, this adaptation struggles to translate its source material's internal ethos debates into compelling drama."
    },
    {
      "title": "Little Women",
      "badge": "❤",
      "review": "Gerwig celebrates sisterhood and creative passion alike through a playful remix of a classic, honoring its warm spirit while subtly modernizing character agency."
    },
    {
      "title": "Mrs. Doubtfire",
      "badge": null,
      "review": "Interesting that the 90s produced a feel-good movie that also centers on divorce and the difficulties of fatherhood."
    },
    {
      "title": "Contact",
      "badge": "★",
      "review": "Is the 'faith vs science' narrative a little too on the nose? Yes, but Jodie Foster's final speech as she converts into a faith-filled person absolutely bangs. Her character's transformation from skeptic to believer is undeniably compelling."
    },
    {
      "title": "Casino",
      "badge": null,
      "review": "Scorsese reunites with De Niro and Pesci to dissect mob-ruled Las Vegas' toxic glitz and greed through the rise and fall of a gambling empire."
    },
    {
      "title": "Goodfellas",
      "badge": "❤",
      "review": "Not a minute wasted in this entire film, every character and scene is a joy to witness, as Scorsese's signature kinetic style and narration perfectly capture the seductive thrill and vicious amorality of life in the mafia."
    },
    {
      "title": "Overnight",
      "badge": "❤",
      "review": "Capturing the meteoric rise and fall of Troy Duffy, a man whose overnight success story quickly turns into a cautionary tale. Unflinching in its portrayal of ego, conflict, and the capriciousness of Hollywood."
    },
    {
      "title": "Under the Silver Lake",
      "badge": null,
      "review": "A neon-noir odyssey through Los Angeles counterculture yields more tone poem than narrative, but memorable imagery and a committed Garfield performance justify the meandering trip through the city."
    },
    {
      "title": "Magnolia",
      "badge": "★",
      "review": "A cinematic miracle. Expertly weaves disparate strands of melancholy lives into an ambitious mosaic depicting romantic, parental, and existential disconnection."
    },
    {
      "title": "Boogie Nights",
      "badge": "❤",
      "review": "An exploration of naive hunger. A seductive, sprawling epic of the American dream at its most lurid and luminous. I'm convinced that if you watched a double feature of this and Requiem for a Dream, you'd never touch a hard drug in your life."
    },
    {
      "title": "Holes",
      "badge": "❤",
      "review": "Manages to be rich in both heart and character, employing an ingenious dual narrative to tell a story of generational curses. I did not expect to like this as much as I did!"
    },
    {
      "title": "Barbie",
      "badge": "❤",
      "review": "Not the Barbie movie making me pause and reflect on the beauty of the mundane human experience."
    },
    {
      "title": "Asteroid City",
      "badge": null,
      "review": "Anderson assembles another talent-stacked ensemble for a story rendered through dreamy retro details and his signature balance of melancholic insight and comedic warmth. Not my favorite Anderson, but fun nonetheless."
    },
    {
      "title": "Clear and Present Danger",
      "badge": "❤",
      "review": "This movie is at its most enjoyable when Harrison Ford is sparring with pencil pushing politicians, and at its most dull when he's escaping certain death in a dad-core windbreaker. A pulpy espionage thriller that works best when it's being cerebral."
    },
    {
      "title": "The Dirties",
      "badge": "❤",
      "review": "A raw and unsettling dive into the dark world of high school alienation and the dangerous fantasies it can spawn. Much darker than I anticipated."
    },
    {
      "title": "RoboCop",
      "badge": "❤",
      "review": "Here's what I want from every action film: Social satire and explosions. A darkly hilarious dystopian satire, packed with social commentary inside violent B-movie packaging."
    },
    {
      "title": "Deadpool",
      "badge": null,
      "review": "Aims for subversive humor and irreverent action but mostly misfires, its barrage of jokes and gore more exhausting than exhilarating."
    },
    {
      "title": "The Taking of Pelham One Two Three",
      "badge": null,
      "review": "The ultimate New York thriller. Walter Matthau's wry, dogged transit cop is a perfect foil to Robert Shaw's cold, calculating mastermind, a duel of wits played out in the underground veins of New York City.",
      "year": 1974
    },
    {
      "title": "Airplane!",
      "badge": null,
      "review": "Utterly breathless, a gag-a-second parody which exemplifies layered visual gags, wordplay, and deadpan absurdity."
    },
    {
      "title": "Chinatown",
      "badge": null,
      "review": "Though bolstered by Nicholson's strong lead turn, this grim homage mistakes lurid cynicism for resonance, leaving its promising story drowned in a level of nihilism that I couldn't stomach."
    },
    {
      "title": "The Long Goodbye",
      "badge": "★",
      "review": "A masterful smoke-filled tribute to the noir genre that feels as timeless as ever. Elliott Gould's portrayal of Philip Marlowe is one of the coolest characters to ever exist. Every time Marlowe struck a match I rewound the film just so I could watch him do it again."
    },
    {
      "title": "Taxi Driver",
      "badge": null,
      "review": "A visceral, hypnotic portrait of a man and a city at their breaking point. Interesting to watch the origin points of so many directorial styles that Hollywood is still emulating."
    },
    {
      "title": "John Wick: Chapter 4",
      "badge": "❤",
      "review": "Expands the kinetic assassin series while deepening its mythos, providing an absolutely stunning final hour as well as an antagonist I actually care about."
    },
    {
      "title": "John Wick: Chapter 3 – Parabellum",
      "badge": "❤",
      "review": "The point at which the franchise fully transitions from standard action fare to our generation's Buster Keaton equivalent. This film forgoes being plot-driven and instead feels like a feature-length excuse to show the audience great stunts in interesting settings."
    },
    {
      "title": "Becoming Nobody",
      "badge": "❤",
      "review": "A heartfelt tribute to the life and teachings of Ram Dass. The film is a warm, wise conversation, and a gentle, guiding hand through the complexities of identity and ego."
    },
    {
      "title": "John Wick: Chapter 2",
      "badge": null,
      "review": "The film's commitment to practical effects and meticulous choreography makes each fight a pleasure to watch."
    },
    {
      "title": "Spider-Man: Into the Spider-Verse",
      "badge": "❤",
      "review": "A much needed reassessment of both animated storytelling and 'comic book movies', with a dazzling style that's a perfect match for its multidimensional tale."
    },
    {
      "title": "Creed II",
      "badge": null,
      "review": "An unnecessary continuation that retreads old Rocky ground instead of building on its predecessor's promise."
    },
    {
      "title": "The Covenant",
      "badge": "❤",
      "review": "Just when I thought the enemy was the Taliban, the movie told me that the real enemy was actually government red tape. And honestly, that's an interesting perspective."
    },
    {
      "title": "John Wick",
      "badge": null,
      "review": "Such a solid use of the one-man-against-the-world genre, single handedly resurrecting the revenge thriller with a sleek, stylized ferocity."
    },
    {
      "title": "Sherlock Jr.",
      "badge": "❤",
      "review": "The first third of this film is a pretty standard silent-era comedy. The second and third acts are pure magic. Keaton's ingenious silent comedy layers sight gag upon sight gag."
    },
    {
      "title": "BlackBerry",
      "badge": "❤",
      "review": "Absolutely my kind of movie, made clear to me when I got goosebumps multiple times (including when they play Steve Jobs' 2007 keynote). Technology is amazing! The people who've developed it are amazing!"
    },
    {
      "title": "Rise of the Planet of the Apes",
      "badge": null,
      "review": "The overarching story where James Franco and his two-dimensional girlfriend fight against the powers that be to save their beloved ape? Not a very good movie! The middle act where an above average intelligence ape recognizes the shortcomings of both humanity and his own kind while learning what it means to be a leader? Now that's a very good movie!"
    },
    {
      "title": "The Pledge",
      "badge": "❤",
      "review": "An understated procedural that excavates the haunting cost of obsession, realized through Jack Nicholson's subdued, simmering performance as a retired detective whose vow to catch a child killer consumes his entire existence."
    },
    {
      "title": "Creep",
      "badge": "❤",
      "review": "A tightly wound found-footage thriller that twists the knife of tension via Duplass' unsettling turn as a profoundly unwell man."
    },
    {
      "title": "Bone Tomahawk",
      "badge": null,
      "review": "Mistakes callous violence and dour misanthropy for profundity, leaving its thin story and characters buried beneath a nihilistic avalanche of gore."
    },
    {
      "title": "Police Story",
      "badge": null,
      "review": "A high-octane, action-packed tour de force, showcasing Jackie Chan's unparalleled physical comedy."
    },
    {
      "title": "12 Angry Men",
      "badge": "★",
      "review": "This claustrophobic courtroom classic simmers with complexity, using confined space and flawed characters to transform an ostensible potboiler into a profound examination of not only the American justice system, but morality itself."
    },
    {
      "title": "Beetlejuice",
      "badge": null,
      "review": "A macabre spin on the traditional fish out of water setups, blending charmingly weird visuals with Keaton's unhinged charisma."
    },
    {
      "title": "Miami Vice",
      "badge": "❤",
      "review": "A glossy, gunmetal portrayal of vice and valor, a stylish ode to the Florida aesthetic of speedboats and mojitos. Anytime someone pulls out a shotgun in a Michael Mann film you know it's time to get hype!"
    },
    {
      "title": "Tetris",
      "badge": null,
      "review": "When Taron Egerton said 'Mario needs Luigi just like Zelda needs Link,' I felt that. Who would have thought that a movie about Tetris would center on geopolitical intrigue?"
    },
    {
      "title": "Dungeons & Dragons: Honor Among Thieves",
      "badge": "❤",
      "review": "This is the type of movie I wish Marvel made. A swords-and-sorcery adventure that translates tabletop gaming onto the big screen expertly."
    },
    {
      "title": "Birdman or (The Unexpected Virtue of Ignorance)",
      "badge": "❤",
      "review": "Michael Keaton delivers a tour-de-force performance, and the film's continuous shot illusion creates a breathless, immersive experience. A darkly comic, surreal exploration of fame, art, and the human condition."
    },
    {
      "title": "Cocaine Bear",
      "badge": null,
      "review": "The gonzo premise stretches its one-joke concept far past the point of diminishing returns, ultimately overdosing on its own ridiculous premise."
    },
    {
      "title": "Computer Chess",
      "badge": null,
      "review": "Shot on era-appropriate video formats, Bujalski's droll portrait of 80s computer nerds pursuing AI breakthroughs harbors both endearing humanity behind the deadpan façade."
    },
    {
      "title": "Dredd",
      "badge": null,
      "review": "Fairly standard action fare with an extremely generic final act, but Urban nails the stoic Judge's gruff character in a way that wishes he was given more to do."
    },
    {
      "title": "Michael Clayton",
      "badge": "❤",
      "review": "A taut legal thriller that delves into the murky morality of high-stakes litigation — and somehow it isn't dry at all? George Clooney delivers a masterfully understated performance as someone coming apart at the seams beneath his polished exterior."
    },
    {
      "title": "The Bridge on the River Kwai",
      "badge": "★",
      "review": "A powerful ode to the complexities of honor and obsession. Alec Guinness delivers an unforgettable performance, and the film's sweeping scope and psychological depth make it a captivating study of war's conflicting loyalties and ironies."
    },
    {
      "title": "Starship Troopers",
      "badge": "❤",
      "review": "Wickedly subversive sci-fi satire that masks trenchant social commentary beneath gory B-movie thrills, taking delightful glee in skewering fascist propaganda."
    },
    {
      "title": "Joker",
      "badge": null,
      "review": "The Scorsese-inspired grit turns out to be a good fit for the longstanding comic book villain, but it's hard to watch this and not want to watch The King of Comedy instead."
    },
    {
      "title": "Fire of Love",
      "badge": "★",
      "review": "An electrifying documentary that fully captures the singular spirit and passion of pioneering volcanologists Katia and Maurice Krafft through stunning archival footage. A love story set against the backdrop of roaring volcanoes and molten landscapes."
    },
    {
      "title": "The Nice Guys",
      "badge": "❤",
      "review": "A rollicking throwback to buddy comedies and noir thrillers, with Crowe in perhaps the most fun role he'll ever play."
    },
    {
      "title": "Heat",
      "badge": "★",
      "review": "The pinnacle of the cops and robbers genre, fueled by the legends De Niro and Pacino at the top of their game. A true modern classic."
    },
    {
      "title": "White Noise",
      "badge": null,
      "review": "Quirky exploration of modern life's existential dread and domestic banality. Not exactly for me, but I couldn't help but appreciate it for what it is.",
      "year": 2022
    },
    {
      "title": "Babylon",
      "badge": "❤",
      "review": "A sprawling, vibrant portrait of Hollywood transitioning from silent films to talkies, anchored by an outstanding ensemble and Chazelle's signature audiovisual flair. The ending montage is wild in a 'I can't believe they actually decided to do that' kind of way."
    },
    {
      "title": "You Were Never Really Here",
      "badge": null,
      "review": "Sparse and visceral, cuts to the bone and leaves a lasting impression. It's a film of few words but high impact, anchored by Phoenix's ferocious performance as a traumatized enforcer caught in a web of corruption."
    },
    {
      "title": "Vanilla Sky",
      "badge": null,
      "review": "Reaches for the profound but gets lost in its own convoluted narrative and heavy-handed symbolism."
    },
    {
      "title": "Bronson",
      "badge": null,
      "review": "Attempts to delve into the chaotic psyche of Britain's most notorious prisoner, but the result is a stylistic exercise that feels more indulgent than insightful. Hardy is committed as ever, but Refn never offers the audience a reason to care."
    },
    {
      "title": "The Aviator",
      "badge": "★",
      "review": "A grandiose portrayal of ambition and madness, painting an intimate portrait of Howard Hughes that captures the billionaire's brilliance and torment with intensity. Every frame is dripping in period detail and cinematic flair."
    },
    {
      "title": "Collateral",
      "badge": "❤",
      "review": "A sleek, nocturnal thriller set in a moody Los Angeles backdrop. Tom Cruise's turn as a silver-haired hitman is chillingly charismatic, and Jamie Foxx delivers a career-defining performance as a cab driver caught in the crossfire."
    },
    {
      "title": "Locke",
      "badge": null,
      "review": "Hardy's dedicated performance can't quite overcome the thin one-man show concept, which stretches a crisis of conscience too thin."
    },
    {
      "title": "Jerrod Carmichael: Rothaniel",
      "badge": "❤",
      "review": "A masterclass in vulnerability, turning a comedy special into a profound exploration of identity and acceptance."
    },
    {
      "title": "Operation Avalanche",
      "badge": "❤",
      "review": "Johnson's alternate history mockumentary nails the retro aesthetic in service of a clever what-if Cold War scenario that gleefully straddles the line between comedy and conspiracy. A true sleeper hit that deserves to be seen."
    },
    {
      "title": "The Banshees of Inisherin",
      "badge": "❤",
      "review": "A sharply observed tragedy with indelible performances from Farrell and Gleeson. An incredible rumination on friendship, solitude, and the human condition."
    },
    {
      "title": "Good Time",
      "badge": null,
      "review": "The frenetic pace and gritty aesthetic aims for a stylish intensity, but overall the film fails to craft characters compelling enough to justify a feature length descent into ugly chaos."
    }
  ],
  "2024": [
    {
      "title": "Casino Royale",
      "badge": "★",
      "review": "Reinvents Bond by stripping him down to bruises, arrogance, and actual consequences. Craig's physicality and vulnerability make this feel dangerous again. The poker scenes are some of my all time favorite cinema, just so watchable.",
      "year": 2006
    },
    {
      "title": "Leave No Trace",
      "badge": "❤",
      "review": "Quiet meditation on trauma and connection that hits different. Nails the father-daughter dynamic of two souls living off-grid. No villains, just people trying their best — and every environment (government buildings, churches, foster systems) feel authentic. Hits you right in the feels without being manipulative af."
    },
    {
      "title": "Conclave",
      "badge": "❤",
      "review": "Vatican politics but gossipy af. Ralph Fiennes brings gravitas to what could've been Da Vinci Code territory. The confined spaces and moral gray areas create this suffocating atmosphere that just works, but it felt a little hamfisted to me. Saw someone call this movie 'Obama era' and that really says everything."
    },
    {
      "title": "Wicked",
      "badge": null,
      "review": "I have no affinity for the musical, so I went into this without any love for the characters or story. The story felt too rushed to ever make me care. Beautiful, tho!"
    },
    {
      "title": "Anora",
      "badge": "❤",
      "review": "Sean Baker is going to get his flowers with this one. Not my favorite film of his by a longshot (that goes to The Florida Project) but it's a ton of fun to witness."
    },
    {
      "title": "Spider-Man: Across the Spider-Verse",
      "badge": "❤",
      "review": "Straight up visual masterpiece. I feel weird gushing over a comic book movie because these simply aren't my thing, but the story is a fantastic encapsulation of what it means to learn to grow up while staying true to yourself."
    },
    {
      "title": "Monsters, Inc.",
      "badge": "❤",
      "review": "Luna's first Pixar movie. Crystal clear character motivations and perfect pacing. Just a joy to watch, and my daughter loves Sully."
    },
    {
      "title": "Sorcerer",
      "badge": "★",
      "review": "A 70s masterpiece about four desperate men driving trucks full of TNT through the rainy jungle. Pure existential dread. That bridge crossing scene is cinema perfection. Makes you realize how little weight modern action movies have because your brain knows it's all CGI and green screen."
    },
    {
      "title": "Jack Reacher",
      "badge": "❤",
      "review": "I'm always down to watch a movie that's just Tom Cruise doing his thing — and as a bonus, you get to watch Herzog in villain mode. Pure fun from the first to last frame."
    },
    {
      "title": "Se7en",
      "badge": "❤",
      "review": "Maybe the best serial killer film of all time? Hard not to notice the atmosphere of this movie with every scene, Fincher making everything look grimy and wet but somehow still beautiful. Freeman and Pitt's chemistry elevates what could've been just another cop movie. That ending still hits."
    },
    {
      "title": "Bad Boys for Life",
      "badge": null,
      "review": "Tries to catch that 90s action comedy lightning in a bottle again but ends up feeling like a cover band. Some decent setpieces but the magic's gone. Smith and Lawrence still have chemistry tho."
    },
    {
      "title": "The Naked Gun",
      "badge": null,
      "review": "Classic Zucker Brothers absurdity that somehow remains hilarious. Nielsen's deadpan delivery carrying the whole thing. Pure comfort food cinema.",
      "year": 1988
    },
    {
      "title": "American Fiction",
      "badge": null,
      "review": "Solid critique of the publishing industry and contemporary fiction, but doesn't quite stick the landing for me. Parts of it act as a straight-up family drama, and I kind of wish the movie would have lingered there more."
    },
    {
      "title": "Trap",
      "badge": null,
      "review": "First act is like a Hitman level, in a good way. Some decent claustrophobic moments, but the third act falls apart faster than the venue's security system. Hartnett brings a raw intensity to his performance that elevates some of the weaker plot points."
    },
    {
      "title": "Aliens",
      "badge": null,
      "review": "Cameron takes Ridley's horror masterpiece and says 'what if we did this but with MARINES tho.' Solid action movie that somehow doesn't diminish the original's terror."
    },
    {
      "title": "Alien",
      "badge": null,
      "review": "The OG space horror. Ripley's character arc is chef's kiss. Giger's designs are some of the best, ever."
    },
    {
      "title": "Shutter Island",
      "badge": "❤",
      "review": "Scorsese doing psychological horror hits different. The twist works even when you know it's coming because the whole thing is actually about grief."
    },
    {
      "title": "Furiosa: A Mad Max Saga",
      "badge": "❤",
      "review": "A sandblasted adrenaline rush. The practical effects go crazy and the world building keeps expanding in ways that actually matter."
    },
    {
      "title": "Napoleon",
      "badge": "❤",
      "review": "Ridley Scott doing his epic thing. Phoenix brings big weirdo energy to Napoleon which honestly tracks. Battle scenes are god tier but the personal stuff is surprisingly engaging too. Not perfect but when it hits it hits."
    },
    {
      "title": "Stand Up Solutions",
      "badge": "❤",
      "review": "There is no describing this. Just go watch it on YouTube."
    },
    {
      "title": "Beyond Utopia",
      "badge": "❤",
      "review": "North Korea defector doc that'll wreck you. Zero propaganda needed when reality is this intense. The footage they got is actually insane — like watching a thriller but it's all real."
    },
    {
      "title": "War for the Planet of the Apes",
      "badge": null,
      "review": "A solid, if somewhat dour, finale to the saga. Tries to be profound but ends up just being long. Caesar is still great."
    },
    {
      "title": "Once Upon a Time in the West",
      "badge": "❤",
      "review": "Leone painting with light and shadow and Morricone's score just floating over everything like a dream. Henry Fonda playing against type as a stone cold killer was genius casting. The glacial pacing WORKS because it makes every punchy gunfight that much more intense."
    },
    {
      "title": "Dune: Part Two",
      "badge": "❤",
      "review": "Dives deeper into the intricacies of Fremen society without losing sight of the larger galactic conflict. The scale is ridiculous but somehow still feels intimate when it needs to. When a Fremen warrior rode atop a sandworm, the banner of House Atreides fluttering in the wind behind them…I felt that."
    },
    {
      "title": "The Good, the Bad and the Ugly",
      "badge": "★",
      "review": "The pinnacle of the spaghetti western. Three hours of tension building to that graveyard standoff. When the music hits and the camera starts doing that thing... pure kino. They don't make 'em like this anymore."
    },
    {
      "title": "Monkey Man",
      "badge": "❤",
      "review": "Mixes John Wick action with mythological weight and class warfare. The underground fight club sequences are raw af, but it's the quiet moments of ritual and revenge that really elevate this. Manages to be both a critique of inequality and a movie where someone gets their face pressed into a hot griddle."
    },
    {
      "title": "For a Few Dollars More",
      "badge": "★",
      "review": "Leone leveled up everything that worked in Fistful. Morricone's watch chimes will be stuck in your head forever."
    },
    {
      "title": "Dune",
      "badge": "★",
      "review": "At its heart, this is a story of prophecy and power. Moves at a relentless pace, every frame is a feast. Doesn't sacrifice depth for spectacle.",
      "year": 2021
    },
    {
      "title": "A Fistful of Dollars",
      "badge": "❤",
      "review": "Leone basically remixed Yojimbo and birthed a whole genre. This is where the modern antihero was born, squinting into the sun and ready to draw."
    },
    {
      "title": "Cosmopolis",
      "badge": null,
      "review": "DeLillo adaptation that's somehow both too literal and not literal enough. Pattinson trapped in a limo while capitalism collapses should work better than this."
    },
    {
      "title": "Road House",
      "badge": "❤",
      "review": "The platonic ideal of a 'this is so dumb it's actually genius' movie. Swayze as a philosophy PhD bouncer is wild concept that somehow works perfectly. Never quite transcends its B-movie trappings, but that's fine.",
      "year": 1989
    },
    {
      "title": "The Big Fix",
      "badge": "❤",
      "review": "A neo-noir gem that captures the disillusionment of post-60s Los Angeles. Actually gets the concept of idealism curdling into cynicism."
    },
    {
      "title": "The Late Show",
      "badge": "❤",
      "review": "Art Carney as an aging private eye in 70s LA. Hits that sweet spot between noir homage and 'everything's different now' energy. A bittersweet ode to growing old in a world that's passed you by."
    },
    {
      "title": "Stalker",
      "badge": "★",
      "review": "Cinema as philosophical inquiry. Every frame is perfect and the pacing is exactly as slow as it needs to be."
    },
    {
      "title": "Ready Player One",
      "badge": null,
      "review": "Spielberg tries to speedrun every pop culture reference ever. Looks cool but feels hollow. Like watching someone else play a video game you don't care about."
    },
    {
      "title": "Mad Max: Fury Road",
      "badge": "❤",
      "review": "This is what happens when you let a madman perfect his craft for 30 years. Basically a two-hour car chase and it rocks."
    },
    {
      "title": "Dawn of the Planet of the Apes",
      "badge": "❤",
      "review": "A rare sequel that surpasses its predecessor. Actually manages to make you care about both sides of a species war. Caesar's internal struggle serves as a microcosm for larger themes of tribalism and the cyclical nature of violence. Blockbuster filmmaking with a brain and a heart."
    },
    {
      "title": "Rogue One: A Star Wars Story",
      "badge": "❤",
      "review": "Best Disney Star Wars no cap. Actually gets what makes the universe interesting. That Vader hallway scene is worth the price of admission alone."
    },
    {
      "title": "Night Moves",
      "badge": "❤",
      "review": "Hackman in peak form as a PI getting way too deep. Florida noir. Left me thinking back through every scene and character's motivations at the end of it.",
      "year": 1975
    },
    {
      "title": "A Beautiful Mind",
      "badge": "★",
      "review": "Idc if it's Oscar bait, this goes hard. Nash's descent into paranoia hits different when you can't trust what you're seeing either."
    },
    {
      "title": "First Reformed",
      "badge": "❤",
      "review": "Schrader basically said 'what if Travis Bickle was a priest.' Ethan Hawke carrying existential dread for two hours straight. A sermon on faith and despair."
    },
    {
      "title": "Escape from L.A.",
      "badge": null,
      "review": "A campy rehash of its predecessor. Snake Plissken surfing through LA is simultaneously the best and worst thing ever put on film. It's trash but like... intentionally? You simply can't say that it isn't fun to watch someone paraglide into battle."
    },
    {
      "title": "Escape from New York",
      "badge": "❤",
      "review": "Carpenter's grimy masterpiece. Kurt Russell's eye patch doing more acting than most modern action stars. The world building is god-tier with like zero exposition. Also so subdued it almost feels inaccurate to call it an action film?"
    },
    {
      "title": "The Stunt Man",
      "badge": "❤",
      "review": "A fugitive stumbles onto a movie set and finds himself a new job. Meta before meta was played out. The stunts actually go crazy too."
    },
    {
      "title": "Virtuosity",
      "badge": null,
      "review": "First act is promising but then it remembers it's a 90s action movie and gets boring. Fails to capitalize on the thematic richness of AI and virtual reality, opting instead for a by-the-numbers approach. Crowe rules tho."
    },
    {
      "title": "Donut King",
      "badge": "❤",
      "review": "Charming documentary about one Cambodian immigrant's story of not only building a donut empire, but impacting the lives of other Cambodians fleeing a horrific genocide. An American dream story that actually acknowledges the nightmare parts, too. Those pink boxes have more cultural impact than most art."
    },
    {
      "title": "Dream Scenario",
      "badge": "❤",
      "review": "An extremely A24-coded exploration of collective consciousness and the Jungian shadow self. Meme culture critique that doesn't feel dated on arrival."
    },
    {
      "title": "Immortals",
      "badge": "❤",
      "review": "Tarsem Singh's visuals carry mid mythology storytelling. Each scene is so visually arresting that I care less about what's happening and more about how it's presented, every frame a lavish, hyper-stylized tableau."
    },
    {
      "title": "Mad Max 2",
      "badge": "❤",
      "review": "Miller expands the franchise's canvas into mythic territory. Where the previous film's world remained recognizably ours, here it becomes the post-apocalyptic hellscape that Miller would continue forward with into Fury Road.",
      "year": 1981
    },
    {
      "title": "Mad Max",
      "badge": null,
      "review": "The low budget original that walked so the sequels could run. You can see Miller learning in real time how to make action perfect."
    },
    {
      "title": "King of New York",
      "badge": "❤",
      "review": "Walken going full crime lord in peak NYC griminess. A descent into the underworld that pulses with 80s-era stylistic excess."
    },
    {
      "title": "Strange Days",
      "badge": "★",
      "review": "Bigelow predicted both VR and the first-person-shooter in '95. LA riots energy + cyberpunk aesthetics = perfect sci-fi noir. A New Year's Eve movie."
    }
  ],
  "2025": [
    {
      "title": "In the Name of the Father",
      "badge": "★",
      "review": "Day-Lewis and Postlethwaite turn a wrongful conviction story into something deeper: A study of dignity (from a man not known for dignity) under impossible pressure. Sheridan lets the injustice speak for itself rather than grandstanding, which makes the courtroom victories hit harder. "
    },
    {
      "title": "3:10 to Yuma",
      "badge": "❤",
      "review": "Crowe and Bale talking about moral complexity for half the runtime? Sign me up. The whole thing hinges on honor versus survival, and Mangold keeps forcing both characters to reconsider which one matters more. The finale earns its ambiguity.",
      "year": 2007
    },
    {
      "title": "The Hurt Locker",
      "badge": "❤",
      "review": "Bigelow's war-as-addiction showcase, with a bomb tech who’s chasing the only high that works for him anymore. I really enjoyed watching Ralph Fiennes aura farm during his character’s introduction."
    },
    {
      "title": "The Accountant 2",
      "badge": null,
      "review": "Affleck returns but the sequel can't recapture what made the first one's weird genre mash work. The action's competent, but the plot doesn’t make any sense at ALL and it’s somehow missing that oddball charm of watching someone kill people with the same intensity that they organize receipts. Serviceable franchise extension that forgot why the original stood out."
    },
    {
      "title": "The Taking of Pelham 123",
      "badge": null,
      "review": "Denzel and Travolta chewing scenery over radio is fun, but ultimately feels like a downgrade from the '74 original's grimy efficiency. Tony Scott's kinetic style can't quite justify the remake, but there's enough cat-and-mouse fun to make it watchable.",
      "year": 2009
    },
    {
      "title": "Bullet Train",
      "badge": null,
      "review": "Tarantino-lite on a train. Honestly felt weird watching it so soon after Kill Bill, not a flattering comparison but I also think it’s good to try and make movies like this. "
    },
    {
      "title": "Caught Stealing",
      "badge": "❤",
      "review": "Aronofsky doing pulp crime with his signature kinetic energy. So interesting to watch him make a straight-up-and-down film without psychological horror or ‘something more’ going on. It’s just a fun time."
    },
    {
      "title": "Sinners",
      "badge": "❤",
      "review": "Coogler doing period horror through a racial justice lens. The vampire mythology gets filtered through Jim Crow-era tension in ways that feel fresh and interesting. "
    },
    {
      "title": "Mikey and Nicky",
      "badge": null,
      "review": "Captures male friendship at its most raw and desperate. Falk and Gazzara's chemistry is lived-in and real, two guys who know each other too well.Not for everyone (and maybe not for me?) but if you're on its wavelength, it's devastating."
    },
    {
      "title": "El Cantante",
      "badge": null,
      "review": "Salsa biopic that hits the expected beats but never transcends them. The rise-and-fall structure feels rote. Still, when he starts Aguanile? That hits."
    },
    {
      "title": "Kill Bill: The Whole Bloody Affair",
      "badge": "❤",
      "review": "Volume 1's precision choreography melding into Volume 2's emotional reckoning creates a sprawling meditation on violence and consequence disguised as a samurai flick."
    },
    {
      "title": "The Driver",
      "badge": "❤",
      "review": "Minimalist heist gem. Feels weird to watch a movie about car chases where every frame is stripped of excess, far from today’s norms.  Pure genre mechanics operating at maximum efficiency. ",
      "year": 1978
    },
    {
      "title": "Who Framed Roger Rabbit",
      "badge": "❤",
      "review": "Pulls off an impossible trick: A noir detective story, a Looney Tunes homage, and a genuinely great story, all in one. A movie that shouldn't exist, and yet here it is."
    },
    {
      "title": "No Time to Die",
      "badge": "❤",
      "review": "Craig's swan song lands with surprising emotional weight. The runtime is bloated and the villain's plan is whatever, but the character work lands. The action is tight, the villains mid, but the ending goes harder than anyone expected. The rare blockbuster finale that actually feels like closure."
    },
    {
      "title": "Into the Abyss",
      "badge": "❤",
      "review": "Herzog on the death penalty. The crimes are horrific, the interviews are awkward and human, and Herzog's own curiosity refuses to let anyone off the hook, including the system itself. It is not trying to shock you, it just calmly shows you a system that puts people to death."
    },
    {
      "title": "Seven Psychopaths",
      "badge": null,
      "review": "The meta stuff is clever, the performances are fun, but the whole thing never quite hits an emotionally resonant core. Still, it has a certain shaggy charm."
    },
    {
      "title": "The Secret Life of Walter Mitty",
      "badge": "❤",
      "review": "Sincere to the point of over-vulnerability. The globe-trotting visuals are gorgeous and the central thesis about actually doing things instead of imagining them hits home. The fantasies cross the line into cringe territory too often for my liking. Still, comfort food cinema."
    },
    {
      "title": "Heretic",
      "badge": "❤",
      "review": "Grant playing against type(?) is inspired casting. The single-location thriller framework gets maximum tension out of escalating arguments about faith. Doesn't always stick its intellectual landing, but commits fully to the horror of certainty."
    },
    {
      "title": "Captain Fantastic",
      "badge": null,
      "review": "Indie dad fantasy in both the best and worst ways. Honestly too twee for its own good, but interesting when it wrestles honestly with the tension between ideology and reality."
    },
    {
      "title": "Debí Tirar Más Fotos",
      "badge": null,
      "review": "More sketch than fully formed narrative, but there is real charm here!"
    },
    {
      "title": "Spectre",
      "badge": "❤",
      "review": "The film strains under the need to tie every previous villain to a single puppet master, but there are flashes of gothic grandeur that fit Craig's weary presence. Not as clean as Skyfall, not as sharp as Casino Royale, still a moody, enjoyable entry."
    },
    {
      "title": "Skyfall",
      "badge": "❤",
      "review": "Bond as prestige drama. The mother-son dynamic between M and 007 elevates it above genre expectations, and the 'old ways are best' theme gives the film an interesting space to play in. Not as solid as the previous two films, but still fun."
    },
    {
      "title": "Quantum of Solace",
      "badge": "❤",
      "review": "Fast, fractured, and (imo) unfairly judged. Feels like the second half of Casino Royale's emotional arc rather than a standalone. Treat it as Bond on a grief bender instead of a standalone adventure and it suddenly clicks."
    },
    {
      "title": "The Card Counter",
      "badge": null,
      "review": "Schrader meditates on guilt, surveillance, and America's moral rot through a man who spends his time traveling the country and playing cards. Probably the most realistic depictions of casinos ever committed to film. Intellectually engaging, not always dramatically satisfying."
    }
  ]
}